# SQL Básico com DuckDB

## Documentação da API em Python
Uma API (Application Programming Interface ou Interface de Programação de Aplicações) é um conjunto de regras e protocolos que permite que diferentes softwares se comuniquem entre si. Simplificando, uma API atua como um intermediário, permitindo que um aplicativo acesse dados ou funcionalidades de outro sem que o primeiro precise conhecer os detalhes internos do segundo. 
* [DuckDB Python API](https://duckdb.org/docs/stable/clients/python/overview)

In [26]:
import duckdb

* [Connection Options](https://duckdb.org/docs/stable/clients/python/overview#connection-options)

In [27]:
conn = duckdb.connect()

* [CREATE TABLE Statement](https://duckdb.org/docs/stable/sql/statements/create_table)

In [28]:
conn.execute("""
    CREATE TABLE pessoas (
        nome TEXT,
        idade INTEGER,
        cidade TEXT
    );
""")

* [INSERT Statement](https://duckdb.org/docs/stable/sql/statements/insert)

In [29]:
conn.execute("""
    INSERT INTO pessoas VALUES
        ('Ana', 22, 'Rio de Janeiro'),
        ('Bruno', 35, 'São Paulo'),
        ('Carla', 19, 'Belo Horizonte'),
        ('Daniel', 40, 'São Paulo'),
        ('Eduarda', 28, 'Curitiba');
""")

* [SELECT Statement](https://duckdb.org/docs/stable/sql/statements/select)

In [30]:
display(conn.execute("""
    SELECT
        * 
    FROM pessoas
""").df())

      nome  idade          cidade
0      Ana     22  Rio de Janeiro
1    Bruno     35       São Paulo
2    Carla     19  Belo Horizonte
3   Daniel     40       São Paulo
4  Eduarda     28        Curitiba

* [WHERE Clause](https://duckdb.org/docs/stable/sql/query_syntax/where)

In [31]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas 
    WHERE idade > 30
""").df())

     nome  idade     cidade
0   Bruno     35  São Paulo
1  Daniel     40  São Paulo

In [32]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas 
    WHERE idade IN (19, 40)
""").df())

     nome  idade          cidade
0   Carla     19  Belo Horizonte
1  Daniel     40       São Paulo

In [33]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas 
    WHERE idade BETWEEN 22 AND 35
""").df())

      nome  idade          cidade
0      Ana     22  Rio de Janeiro
1    Bruno     35       São Paulo
2  Eduarda     28        Curitiba

* [Pattern Matching](https://duckdb.org/docs/stable/sql/functions/pattern_matching)

In [34]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas 
    WHERE nome LIKE '%a'
""").df())

      nome  idade          cidade
0      Ana     22  Rio de Janeiro
1    Carla     19  Belo Horizonte
2  Eduarda     28        Curitiba

* [ORDER BY Clause](https://duckdb.org/docs/stable/sql/query_syntax/orderby)

In [35]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas
    ORDER BY idade DESC
""").df())

      nome  idade          cidade
0   Daniel     40       São Paulo
1    Bruno     35       São Paulo
2  Eduarda     28        Curitiba
3      Ana     22  Rio de Janeiro
4    Carla     19  Belo Horizonte

* [LIMIT and OFFSET Clauses](https://duckdb.org/docs/stable/sql/query_syntax/limit)

In [36]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas
    LIMIT 3
""").df())

    nome  idade          cidade
0    Ana     22  Rio de Janeiro
1  Bruno     35       São Paulo
2  Carla     19  Belo Horizonte

In [37]:
display(conn.execute("""
    SELECT
        *
    FROM pessoas
    LIMIT 3
    OFFSET 2
""").df())

      nome  idade          cidade
0    Carla     19  Belo Horizonte
1   Daniel     40       São Paulo
2  Eduarda     28        Curitiba

* [Aggregate Functions](https://duckdb.org/docs/stable/sql/functions/aggregates)

In [38]:
display(conn.execute("""
    SELECT
        SUM(idade) as soma_das_idades
    FROM pessoas
""").df())

   soma_das_idades
0            144.0

* [GROUP BY Clause](https://duckdb.org/docs/stable/sql/query_syntax/groupby)

In [39]:
display(conn.execute("""
    SELECT
        cidade,
        COUNT(*) as total
    FROM pessoas
    GROUP BY cidade
""").df())

           cidade  total
0  Rio de Janeiro      1
1       São Paulo      2
2  Belo Horizonte      1
3        Curitiba      1

* [HAVING Clause](https://duckdb.org/docs/stable/sql/query_syntax/having)

In [40]:
display(conn.execute("""
    SELECT
        cidade,
        COUNT(*) as total
    FROM pessoas
    GROUP BY cidade
    HAVING total = 1
""").df())

           cidade  total
0  Rio de Janeiro      1
1  Belo Horizonte      1
2        Curitiba      1

* [CASE Expression](https://duckdb.org/docs/stable/sql/expressions/case)

In [42]:
display(conn.execute("""
    SELECT *,
        CASE
            WHEN idade < 25 THEN 'jovem'
            WHEN idade BETWEEN 25 AND 39 THEN 'adulto'
            ELSE 'idoso'
        END AS faixa_etaria
    FROM pessoas
    WHERE faixa_etaria = 'jovem'
""").df())

    nome  idade          cidade faixa_etaria
0    Ana     22  Rio de Janeiro        jovem
1  Carla     19  Belo Horizonte        jovem

In [17]:
conn.close()